<!DOCTYPE html>
<html>
<body>
<div align="center">
<h3>Prepared by Asif Bhat</h3>
    
<h1>Pandas - Series & Dataframes</h1>

<h3>Follow Me on - <a href="https://www.linkedin.com/in/asif-bhat/">LinkedIn</a>&nbsp; <a href="https://mobile.twitter.com/_asifbhat_">Twitter</a>&nbsp; <a href="https://www.instagram.com/datasciencescoop/?hl=en">Instagram</a>&nbsp; <a href="https://www.facebook.com/datasciencescoop/">Facebook</a></h3>
</div>
</body>
</html>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import glob
import re
import math

In [2]:
!pip install numpy

Requirement already satisfied: numpy in /Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages (1.18.2)

# Series

## Create Series

In [3]:
# Create series from Nump Array
v = np.array([1,2,3,4,5,6,7])
print(v)
s1 = pd.Series(v)
s1

[1 2 3 4 5 6 7]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [4]:
#Datatype of Series
sr = pd.Series(['1/1/2018', '2/1/2018', '3/1/2018', '4/1/2018'])
sr.dtype

dtype('O')

In [5]:
# Number of bytes consumed by Series
s1.nbytes

56

In [6]:
# Shape of the Series
s1.shape

(7,)

In [7]:
# number of dimensions
s1.ndim

1

In [8]:
# Length of Series
len(s1)

7

In [9]:
s1.count()

7

In [10]:
s1.size

7

In [11]:
# Create series from List 
s0 = pd.Series([1,2,3], index = ['a','b','c'])
s0

a    1
b    2
c    3
dtype: int64

In [12]:
# Modifying index in Series
s1.index = ['a' , 'b' , 'c' , 'd' , 'e' , 'f' , 'good']
s1

a       1
b       2
c       3
d       4
e       5
f       6
good    7
dtype: int64

In [13]:
# Create Series using Random and Range function
v2 = np.random.random(10)
ind2 = np.arange(0,10)
s = pd.Series(v2,ind2)
v2 , ind2 , s

(array([0.56253061, 0.27479273, 0.4738658 , 0.95608777, 0.91449901,
        0.74825497, 0.15200999, 0.54716652, 0.29102112, 0.22954612]),
 array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 0    0.562531
 1    0.274793
 2    0.473866
 3    0.956088
 4    0.914499
 5    0.748255
 6    0.152010
 7    0.547167
 8    0.291021
 9    0.229546
 dtype: float64)

In [14]:
# Creating Series from Dictionary
dict1 = {'a1' :10 , 'a2' :20 , 'a3':30 , 'a4':40}
s3 = pd.Series(dict1)
s3, dict1

(a1    10
 a2    20
 a3    30
 a4    40
 dtype: int64,
 {'a1': 10, 'a2': 20, 'a3': 30, 'a4': 40})

In [15]:
pd.Series(10, index=[2,5,7])

2    10
5    10
7    10
dtype: int64

In [16]:
pd.Series(99, index=[0, 1, 2, 3, 4, 5])

0    99
1    99
2    99
3    99
4    99
5    99
dtype: int64

## Slicing Series

In [17]:
s

0    0.562531
1    0.274793
2    0.473866
3    0.956088
4    0.914499
5    0.748255
6    0.152010
7    0.547167
8    0.291021
9    0.229546
dtype: float64

In [18]:
# Return all elements of the series
s[:]

0    0.562531
1    0.274793
2    0.473866
3    0.956088
4    0.914499
5    0.748255
6    0.152010
7    0.547167
8    0.291021
9    0.229546
dtype: float64

In [19]:
# First three element of the Series
s[0:3]

0    0.562531
1    0.274793
2    0.473866
dtype: float64

In [20]:
# Last element of the Series
s[-1:]

9    0.229546
dtype: float64

In [21]:
# Fetch first 4 elements in a series
s[:4]

0    0.562531
1    0.274793
2    0.473866
3    0.956088
dtype: float64

In [22]:
# Return all elements of the series except last two elements.
s[:-2]

0    0.562531
1    0.274793
2    0.473866
3    0.956088
4    0.914499
5    0.748255
6    0.152010
7    0.547167
dtype: float64

In [23]:
# Return all elements of the series except last element.
s[:-1]

0    0.562531
1    0.274793
2    0.473866
3    0.956088
4    0.914499
5    0.748255
6    0.152010
7    0.547167
8    0.291021
dtype: float64

In [24]:
# Return last two elements of the series
s[-2:]

8    0.291021
9    0.229546
dtype: float64

In [25]:
# # Return last element of the series
s[-1:]

9    0.229546
dtype: float64

In [26]:
s[-3:-1]

7    0.547167
8    0.291021
dtype: float64

## Append Series

In [27]:
s2 = s1.copy()
s2

a       1
b       2
c       3
d       4
e       5
f       6
good    7
dtype: int64

In [28]:
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [29]:
# Append S2 & S3 Series
s4 = s2.append(s3)
s4

a        1
b        2
c        3
d        4
e        5
f        6
good     7
a1      10
a2      20
a3      30
a4      40
dtype: int64

In [30]:
# When "inplace=False" it will return a new copy of data with the operation performed
s4.drop('a3', inplace=True)
s4

a        1
b        2
c        3
d        4
e        5
f        6
good     7
a1      10
a2      20
a4      40
dtype: int64

In [31]:
s4

a        1
b        2
c        3
d        4
e        5
f        6
good     7
a1      10
a2      20
a4      40
dtype: int64

In [32]:
# When we use "inplace=True" it will affect the dataframe
s4.drop('a4', inplace=True)
s4

a        1
b        2
c        3
d        4
e        5
f        6
good     7
a1      10
a2      20
dtype: int64

In [33]:
s5 = pd.Series({'a4': 7}) 
s6 = pd.Series(data=[7], index=['a4'])
s4 = s4.append(s5)
s4,s5, s6

(a        1
 b        2
 c        3
 d        4
 e        5
 f        6
 good     7
 a1      10
 a2      20
 a4       7
 dtype: int64,
 a4    7
 dtype: int64,
 a4    7
 dtype: int64)

In [34]:
s4 = s4.append(pd.Series({'a4': 7}))
s4

a        1
b        2
c        3
d        4
e        5
f        6
good     7
a1      10
a2      20
a4       7
a4       7
dtype: int64

## Operation on Series

In [35]:
v1 = np.array([10,20,30])
v2 = np.array([1,2,3])
s1 = pd.Series(v1) 
s2 = pd.Series(v2)
s1 , s2

(0    10
 1    20
 2    30
 dtype: int64,
 0    1
 1    2
 2    3
 dtype: int64)

In [36]:
s1.append(s2)

0    10
1    20
2    30
0     1
1     2
2     3
dtype: int64

In [37]:
# Addition of two series
s1.add(s2)

0    11
1    22
2    33
dtype: int64

In [38]:
# Subtraction of two series
s1.sub(s2)

0     9
1    18
2    27
dtype: int64

In [39]:
# Subtraction of two series
s1.subtract(s2)

0     9
1    18
2    27
dtype: int64

In [40]:
# Increment all numbers in a series by 9
s1 = s1.add(9)

In [41]:
# Multiplication of two series
s1.mul(s2)

0     19
1     58
2    117
dtype: int64

In [42]:
# Multiplication of two series
s1.multiply(s2)

0     19
1     58
2    117
dtype: int64

In [43]:
# Multiply each element by 1000
s1.multiply(1000)

0    19000
1    29000
2    39000
dtype: int64

In [44]:
# Division
s1.divide(s2)

0    19.0
1    14.5
2    13.0
dtype: float64

In [45]:
# Division
s1.div(s2)

0    19.0
1    14.5
2    13.0
dtype: float64

In [46]:
# MAX number in a series
s1.max()

39

In [47]:
# Min number in a series
s1.min()

19

In [48]:
# Average
s1.mean()

29.0

In [49]:
# Median
s1.median()

29.0

In [50]:
# Standard Deviation
s1.std()

10.0

In [51]:
# Series comparison
s1.equals(s2)

False

In [52]:
s4 =s1

In [53]:
# Series comparison
s1.equals(s4)

True

In [54]:
s5 = pd.Series([1,1,1,2,3,3], index=[0, 1, 2, 3, 4, 5])
s5

0    1
1    1
2    1
3    2
4    3
5    3
dtype: int64

In [55]:
s5.value_counts()

1    3
3    2
2    1
dtype: int64

# DataFrame

## Create DataFrame

In [56]:
import pandas as pd
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [57]:
# Create Dataframe using List
lang = ['Java' , 'Python' , 'C' , 'C++']
df = pd.DataFrame(lang)
s = pd.Series(lang)
print(s)
df

0      Java
1    Python
2         C
3       C++
dtype: object

        0
0    Java
1  Python
2       C
3     C++

In [58]:
# Add column in the Dataframe
rating = [1,2,3,4]
df['abbas2'] = lang
df['Jacob'] = [2,3,4,5]
df

        0  abbas2  Jacob
0    Java    Java      2
1  Python  Python      3
2       C       C      4
3     C++     C++      5

In [59]:
df.columns = ['Majid', 'Chaim', 'matis']

In [60]:
df

    Majid   Chaim  matis
0    Java    Java      2
1  Python  Python      3
2       C       C      4
3     C++     C++      5

In [61]:
# Create Dataframe from Dictionary

data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 'abc'}]

df2 = pd.DataFrame(data)
# df3 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b'])
# df4 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b' ,'c'])
# df5 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b' ,'c' , 'd','e'])

In [62]:
df2

   a   b    c
0  1   2  NaN
1  5  10  abc

In [63]:
df3 = pd.DataFrame(data, index=['row1', 'row2'])
df3

      a   b    c
row1  1   2  NaN
row2  5  10  abc

In [64]:
df4 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b' ,'newc'])
df4

      a   b  newc
row1  1   2   NaN
row2  5  10   NaN

In [65]:
df5

NameError: name 'df5' is not defined

In [66]:
# Create Dataframe from Dictionary
df0 = pd.DataFrame({'ID' :[1,2,3,4] , 'Name' :['Asif' , 'Basit' , 'Ross' , 'John']}, index=['row1', 'row2','row3','row4'])
df0

      ID   Name
row1   1   Asif
row2   2  Basit
row3   3   Ross
row4   4   John

In [67]:
# Create a DataFrame from Dictionary of Series
dict = {'A' : pd.Series([1, 2, 3],    index=['a', 'b', 'c']),
        'B' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df1 = pd.DataFrame(dict)
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

#### Dataframe of Random Numbers with Date Indices

In [68]:
np.arange(0,25)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24])

In [69]:
dates = pd.date_range(start='2020-01-20', end='2020-01-26')
dates

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [70]:
dates = pd.date_range('today',periods= 16)
dates

DatetimeIndex(['2020-05-13 20:22:31.963573', '2020-05-14 20:22:31.963573',
               '2020-05-15 20:22:31.963573', '2020-05-16 20:22:31.963573',
               '2020-05-17 20:22:31.963573', '2020-05-18 20:22:31.963573',
               '2020-05-19 20:22:31.963573', '2020-05-20 20:22:31.963573',
               '2020-05-21 20:22:31.963573', '2020-05-22 20:22:31.963573',
               '2020-05-23 20:22:31.963573', '2020-05-24 20:22:31.963573',
               '2020-05-25 20:22:31.963573', '2020-05-26 20:22:31.963573',
               '2020-05-27 20:22:31.963573', '2020-05-28 20:22:31.963573'],
              dtype='datetime64[ns]', freq='D')

In [71]:
dates = pd.date_range(start='2020-01-20', periods=7)
dates

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [72]:
# 9.73777804e-02 = .0973...  this is a exponential representation of a number

In [73]:
M = np.random.random((7,7))
M

array([[0.99325825, 0.43189079, 0.79140551, 0.96590621, 0.37683521,
        0.20561404, 0.32626402],
       [0.2777543 , 0.84316453, 0.77605328, 0.83795055, 0.56313848,
        0.13916057, 0.53496432],
       [0.69707849, 0.91920328, 0.82228717, 0.91038796, 0.02755588,
        0.64253172, 0.66538593],
       [0.07551906, 0.89395546, 0.1019153 , 0.92482651, 0.3481645 ,
        0.87927501, 0.75240723],
       [0.75002153, 0.14079836, 0.53312561, 0.67761999, 0.01700864,
        0.48124248, 0.36065339],
       [0.72530514, 0.94351437, 0.26360974, 0.42827127, 0.15092343,
        0.22439353, 0.28529908],
       [0.07759714, 0.40677862, 0.22956108, 0.84261315, 0.11991069,
        0.66552818, 0.66907886]])

In [74]:
dframe = pd.DataFrame(M , index=dates)
dframe

,0,1,2,3,4,5,6
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-21,0.277754,0.843165,0.776053,0.837951,0.563138,0.139161,0.534964
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-23,0.075519,0.893955,0.101915,0.924827,0.348165,0.879275,0.752407
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,0.077597,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [75]:
#Changing Column Names
dframe.columns = ['C1' , 'C2' , 'C3', 'C4', 'C5', 'C6', 'C7']
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-21,0.277754,0.843165,0.776053,0.837951,0.563138,0.139161,0.534964
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-23,0.075519,0.893955,0.101915,0.924827,0.348165,0.879275,0.752407
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,0.077597,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [76]:
# List Index
dframe.index

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [77]:
# List Column Names
dframe.columns

Index(['C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7'], dtype='object')

In [78]:
# Datatype of each column
dframe.dtypes

C1    float64
C2    float64
C3    float64
C4    float64
C5    float64
C6    float64
C7    float64
dtype: object

In [79]:
# Sort Dataframe by Column 'C1' in Ascending Order
dframe.sort_values(by='C1')

,C1,C2,C3,C4,C5,C6,C7
2020-01-23,0.075519,0.893955,0.101915,0.924827,0.348165,0.879275,0.752407
2020-01-26,0.077597,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079
2020-01-21,0.277754,0.843165,0.776053,0.837951,0.563138,0.139161,0.534964
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264

In [80]:
# Sort Dataframe by Column 'C1' in Descending Order
dframe.sort_values(by='C1' , ascending=False)

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-21,0.277754,0.843165,0.776053,0.837951,0.563138,0.139161,0.534964
2020-01-26,0.077597,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079
2020-01-23,0.075519,0.893955,0.101915,0.924827,0.348165,0.879275,0.752407

## Delete Column in DataFrame

In [81]:
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

In [82]:
# Delete Column using "del" function
del df1['B']

In [83]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [84]:
df5

NameError: name 'df5' is not defined

In [85]:
# Delete Column using pop()
# c_col = df5.pop('c')
c_col

NameError: name 'c_col' is not defined

In [86]:
df5

NameError: name 'df5' is not defined

## Data Selection in Dataframe

In [87]:
df

    Majid   Chaim  matis
0    Java    Java      2
1  Python  Python      3
2       C       C      4
3     C++     C++      5

In [88]:
df.index = [1,2,3,4]
df

    Majid   Chaim  matis
1    Java    Java      2
2  Python  Python      3
3       C       C      4
4     C++     C++      5

In [89]:
# Data selection using row label
df.loc[3]

Majid    C
Chaim    C
matis    4
Name: 3, dtype: object

In [90]:
# Data selection using position (Integer Index based)
df.iloc[3]

Majid    C++
Chaim    C++
matis      5
Name: 4, dtype: object

In [91]:
df.loc[1:2]

    Majid   Chaim  matis
1    Java    Java      2
2  Python  Python      3

In [92]:
df.iloc[1:2]

    Majid   Chaim  matis
2  Python  Python      3

In [93]:
df.columns = [0, 1, 'Rating']
df

        0       1  Rating
1    Java    Java       2
2  Python  Python       3
3       C       C       4
4     C++     C++       5

In [94]:
df[df[1] == 'Python']
# df[df['Country']=='USA']

        0       1  Rating
2  Python  Python       3

In [95]:
# Data selection based on Condition
df.loc[df[1] == 'Python']

        0       1  Rating
2  Python  Python       3

In [96]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [97]:
# Row & Column label based selection
df1.loc['a']

A    1.0
Name: a, dtype: float64

In [98]:
df1.iloc['a'] # This will throw error because iloc will not work on labels

TypeError: Cannot index by location index with a non-integer key

In [99]:
dframe[(dframe['C1']>.5) & (dframe['C1']<.8)]

,C1,C2,C3,C4,C5,C6,C7
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299

In [100]:
temp = dframe.copy()
temp = temp.reset_index()

In [101]:
# Data selection using Row Label
dframe['2020-01-20' : '2020-01-22' ]

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-21,0.277754,0.843165,0.776053,0.837951,0.563138,0.139161,0.534964
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386

In [102]:
# Selecting all rows & selected columns
dframe.loc[:,['C1' , 'C7']]

                  C1        C7
2020-01-20  0.993258  0.326264
2020-01-21  0.277754  0.534964
2020-01-22  0.697078  0.665386
2020-01-23  0.075519  0.752407
2020-01-24  0.750022  0.360653
2020-01-25  0.725305  0.285299
2020-01-26  0.077597  0.669079

In [103]:
#row & column label based selection
dframe.loc['2020-01-20' : '2020-01-22',['C1' , 'C7']]

                  C1        C7
2020-01-20  0.993258  0.326264
2020-01-21  0.277754  0.534964
2020-01-22  0.697078  0.665386

In [104]:
# Data selection based on Condition
dframe[dframe['C1'] > 0.5]

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299

In [105]:
# Data selection based on Condition
dframe[(dframe['C1'] > 0.5) & (dframe['C4'] > 0.5)]

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653

In [106]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.993258,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-21,0.277754,0.843165,0.776053,0.837951,0.563138,0.139161,0.534964
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-23,0.075519,0.893955,0.101915,0.924827,0.348165,0.879275,0.752407
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,0.077597,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [107]:
# Data selection using position (Integer Index based)
dframe.iloc[1][2]

0.776053277232913

In [108]:
# Select all rows & first three columns
dframe.iloc[:,0:3]
# dframe.iloc[2:4,-3:-1]

                  C1        C2        C3
2020-01-20  0.993258  0.431891  0.791406
2020-01-21  0.277754  0.843165  0.776053
2020-01-22  0.697078  0.919203  0.822287
2020-01-23  0.075519  0.893955  0.101915
2020-01-24  0.750022  0.140798  0.533126
2020-01-25  0.725305  0.943514  0.263610
2020-01-26  0.077597  0.406779  0.229561

In [109]:
dframe.iloc[0,0] = 10
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,10.000000,0.431891,0.791406,0.965906,0.376835,0.205614,0.326264
2020-01-21,0.277754,0.843165,0.776053,0.837951,0.563138,0.139161,0.534964
2020-01-22,0.697078,0.919203,0.822287,0.910388,0.027556,0.642532,0.665386
2020-01-23,0.075519,0.893955,0.101915,0.924827,0.348165,0.879275,0.752407
2020-01-24,0.750022,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,0.725305,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,0.077597,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [110]:
# Display all rows where C1 has value of 10 or 20
dframe['C1'].isin([10,0.3522387288648713])

2020-01-20     True
2020-01-21    False
2020-01-22    False
2020-01-23    False
2020-01-24    False
2020-01-25    False
2020-01-26    False
Freq: D, Name: C1, dtype: bool

## Set Value

In [111]:
# Set value of 888 for all elements in column 'C1'
dframe['C1'] = 888
dframe

             C1        C2        C3        C4        C5        C6        C7
2020-01-20  888  0.431891  0.791406  0.965906  0.376835  0.205614  0.326264
2020-01-21  888  0.843165  0.776053  0.837951  0.563138  0.139161  0.534964
2020-01-22  888  0.919203  0.822287  0.910388  0.027556  0.642532  0.665386
2020-01-23  888  0.893955  0.101915  0.924827  0.348165  0.879275  0.752407
2020-01-24  888  0.140798  0.533126  0.677620  0.017009  0.481242  0.360653
2020-01-25  888  0.943514  0.263610  0.428271  0.150923  0.224394  0.285299
2020-01-26  888  0.406779  0.229561  0.842613  0.119911  0.665528  0.669079

In [112]:
# Set value of 777 for first three rows in Column 'C6'
dframe.at[0:3,'C6'] = 777

In [113]:
dframe

             C1        C2        C3        C4        C5          C6        C7
2020-01-20  888  0.431891  0.791406  0.965906  0.376835  777.000000  0.326264
2020-01-21  888  0.843165  0.776053  0.837951  0.563138  777.000000  0.534964
2020-01-22  888  0.919203  0.822287  0.910388  0.027556  777.000000  0.665386
2020-01-23  888  0.893955  0.101915  0.924827  0.348165    0.879275  0.752407
2020-01-24  888  0.140798  0.533126  0.677620  0.017009    0.481242  0.360653
2020-01-25  888  0.943514  0.263610  0.428271  0.150923    0.224394  0.285299
2020-01-26  888  0.406779  0.229561  0.842613  0.119911    0.665528  0.669079

In [114]:
# Set value of 333 in first row and third column
dframe.iat[3,3] = 333

In [115]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,777.000000,0.326264
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,777.000000,0.534964
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,0.665386
2020-01-23,888,0.893955,0.101915,333.000000,0.348165,0.879275,0.752407
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,888,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [116]:
dframe.iloc[3,4] = 555
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,777.000000,0.326264
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,777.000000,0.534964
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,0.665386
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,0.752407
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,888,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [117]:
dframe1 = dframe.copy(deep=False)
dframe1

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,777.000000,0.326264
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,777.000000,0.534964
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,0.665386
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,0.752407
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,888,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [118]:
# Create Copy of the calling objects data along with indices.
# Modifications to the data or indices of the copy will not be reflected in the original object 
dframe1 = dframe.copy(deep=True)
dframe1

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,777.000000,0.326264
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,777.000000,0.534964
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,0.665386
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,0.752407
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,888,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [119]:
dframe1[(dframe1['C1'] > 0.5) & (dframe1['C4'] > 0.5)]=13
dframe1

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-21,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-22,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-23,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-24,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-25,888,0.943514,0.26361,0.428271,0.150923,0.224394,0.285299
2020-01-26,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000

In [120]:
dframe1[dframe1['C1'] == 0]

Empty DataFrame
Columns: [C1, C2, C3, C4, C5, C6, C7]
Index: []

In [121]:
# Replace zeros in Column C1 with 99
dframe1[dframe1['C1'].isin([0])] = 99
dframe1

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-21,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-22,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-23,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-24,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000
2020-01-25,888,0.943514,0.26361,0.428271,0.150923,0.224394,0.285299
2020-01-26,13,13.000000,13.00000,13.000000,13.000000,13.000000,13.000000

In [122]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,777.000000,0.326264
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,777.000000,0.534964
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,0.665386
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,0.752407
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,0.360653
2020-01-25,888,0.943514,0.263610,0.428271,0.150923,0.224394,0.285299
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,0.669079

In [123]:
# Display all rows where value of C1 is 99
dframe1[dframe1['C1'] == 99]

Empty DataFrame
Columns: [C1, C2, C3, C4, C5, C6, C7]
Index: []

In [124]:
dframe.C1 # dframe['C1']

2020-01-20    888
2020-01-21    888
2020-01-22    888
2020-01-23    888
2020-01-24    888
2020-01-25    888
2020-01-26    888
Freq: D, Name: C1, dtype: int64

## Dealing with NULL Values

In [125]:
dframe.at[0:8 , 'C7'] = np.NaN
dframe.at[0:2 , 'C6'] = np.NaN
dframe.at[5:6 , 'C5'] = np.NaN
dframe

             C1        C2        C3          C4          C5          C6  C7
2020-01-20  888  0.431891  0.791406    0.965906    0.376835         NaN NaN
2020-01-21  888  0.843165  0.776053    0.837951    0.563138         NaN NaN
2020-01-22  888  0.919203  0.822287    0.910388    0.027556  777.000000 NaN
2020-01-23  888  0.893955  0.101915  333.000000  555.000000    0.879275 NaN
2020-01-24  888  0.140798  0.533126    0.677620    0.017009    0.481242 NaN
2020-01-25  888  0.943514  0.263610    0.428271         NaN    0.224394 NaN
2020-01-26  888  0.406779  0.229561    0.842613    0.119911    0.665528 NaN

In [126]:
# Detect Non-Missing Values
# It will return True for NOT-NULL values and False for NULL values
dframe.notna()

              C1    C2    C3    C4     C5     C6     C7
2020-01-20  True  True  True  True   True  False  False
2020-01-21  True  True  True  True   True  False  False
2020-01-22  True  True  True  True   True   True  False
2020-01-23  True  True  True  True   True   True  False
2020-01-24  True  True  True  True   True   True  False
2020-01-25  True  True  True  True  False   True  False
2020-01-26  True  True  True  True   True   True  False

In [127]:
# Detect Missing or NULL Values
# It will return True for NULL values and False for NOT-NULL values
dframe.isna()

               C1     C2     C3     C4     C5     C6    C7
2020-01-20  False  False  False  False  False   True  True
2020-01-21  False  False  False  False  False   True  True
2020-01-22  False  False  False  False  False  False  True
2020-01-23  False  False  False  False  False  False  True
2020-01-24  False  False  False  False  False  False  True
2020-01-25  False  False  False  False   True  False  True
2020-01-26  False  False  False  False  False  False  True

In [128]:
# Fill all NULL values with 1020
dframe = dframe.fillna(1020)
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,1020.000000,1020.0
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,1020.000000,1020.0
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,1020.0
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,1020.0
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,1020.0
2020-01-25,888,0.943514,0.263610,0.428271,1020.000000,0.224394,1020.0
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,1020.0

In [129]:
dframe.at[0:5 , 'C7'] = np.NaN
dframe.at[0:2 , 'C6'] = np.NaN
dframe.at[5:6 , 'C5'] = np.NaN
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,NaN,NaN
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,NaN,NaN
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,NaN
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,NaN
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,NaN
2020-01-25,888,0.943514,0.263610,0.428271,NaN,0.224394,1020.0
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,1020.0

In [130]:
# Replace Null values in Column 'C5' with number 123
# Replace Null values in Column 'C6' with number 789
dframe.fillna(value={'C1' : 123 , 'C6' : 789})

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,789.000000,NaN
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,789.000000,NaN
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,NaN
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,NaN
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,NaN
2020-01-25,888,0.943514,0.263610,0.428271,NaN,0.224394,1020.0
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,1020.0

In [134]:
#Replace first NULL value in Column C7 with 789
dframe.fillna(value={'C7' : 789} , limit=1)
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,NaN,NaN
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,NaN,NaN
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,NaN
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,NaN
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,NaN
2020-01-25,888,0.943514,0.263610,0.428271,NaN,0.224394,1020.0
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,1020.0

In [132]:
# Drop Rows with NULL values
# dframe.dropna(inplace=True)
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,NaN,NaN
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,NaN,NaN
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,NaN
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,NaN
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,NaN
2020-01-25,888,0.943514,0.263610,0.428271,NaN,0.224394,1020.0
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,1020.0

In [136]:
# Drop Columns with NULL values
dframe.dropna(axis='columns')

             C1        C2        C3          C4
2020-01-20  888  0.431891  0.791406    0.965906
2020-01-21  888  0.843165  0.776053    0.837951
2020-01-22  888  0.919203  0.822287    0.910388
2020-01-23  888  0.893955  0.101915  333.000000
2020-01-24  888  0.140798  0.533126    0.677620
2020-01-25  888  0.943514  0.263610    0.428271
2020-01-26  888  0.406779  0.229561    0.842613

In [137]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.431891,0.791406,0.965906,0.376835,NaN,NaN
2020-01-21,888,0.843165,0.776053,0.837951,0.563138,NaN,NaN
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,NaN
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,NaN
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,NaN
2020-01-25,888,0.943514,0.263610,0.428271,NaN,0.224394,1020.0
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,1020.0

In [138]:
# Drop Rows with NULL values present in C5 or C6
dframe.dropna(subset=['C5' ,'C6'])

,C1,C2,C3,C4,C5,C6,C7
2020-01-22,888,0.919203,0.822287,0.910388,0.027556,777.000000,NaN
2020-01-23,888,0.893955,0.101915,333.000000,555.000000,0.879275,NaN
2020-01-24,888,0.140798,0.533126,0.677620,0.017009,0.481242,NaN
2020-01-26,888,0.406779,0.229561,0.842613,0.119911,0.665528,1020.0

## Descriptive Statistics

In [ ]:
# Fill NULL values with 55
dframe.fillna(55 , inplace=True)
dframe

In [ ]:
# Mean of all Columns
dframe.mean()

In [ ]:
# Max value per column
dframe.max()

In [ ]:
# Min value per column
dframe.min()

In [ ]:
# Median 
dframe.median()

In [ ]:
dframe.std() #Standard Deviation

In [ ]:
dframe.var()  #Variance

In [ ]:
#Lower Quartile / First Quartile
dframe.quantile(0.25)

In [ ]:
#Second Quartile / Median
dframe.quantile(0.50)

In [ ]:
# Upper Quartile
dframe.quantile(0.75)

In [ ]:
 #IQR (Interquartile Range)
dframe.quantile(0.75) - dframe.quantile(0.25)

In [ ]:
# SUM of column values
dframe.sum()

In [ ]:
# GENERATES DESCRIPTIVE STATS
dframe.describe()

In [ ]:
#Return unbiased skew
# https://www.youtube.com/watch?v=HnMGKsupF8Q
dframe.skew()

In [ ]:
# Return unbiased kurtosis using Fishers definition of kurtosis
# https://www.youtube.com/watch?v=HnMGKsupF8Q
dframe.kurt()

In [ ]:
#Correlation
# https://www.youtube.com/watch?v=qtaqvPAeEJY&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=10
# https://www.youtube.com/watch?v=xZ_z8KWkhXE&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=11
dframe.corr()

In [ ]:
#Covariance
# https://www.youtube.com/watch?v=qtaqvPAeEJY&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=10
# https://www.youtube.com/watch?v=xZ_z8KWkhXE&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=11
dframe.cov()

In [ ]:
import statistics as st
dframe.at[3:6,'C1'] = 22
dframe

In [ ]:
# Average 
st.mean(dframe['C1'])

In [ ]:
# Hormonic Mean
st.harmonic_mean(dframe['C1'])

In [ ]:
#Returns average of the two middle numbers when length is EVEN
arr = np.array([1,2,3,4,5,6,7,8])
st.median(arr)

In [ ]:
# low median of the data with EVEN length
st.median_low(arr)

In [ ]:
# High median of the data with EVEN length
st.median_high(arr)

In [ ]:
# Mode of Dataset
st.mode(dframe['C7'])

In [ ]:
# Sample Variance
st.variance(dframe['C1'])

In [ ]:
#Population Variance
st.pvariance(dframe['C1'])

In [ ]:
#Sample  Standard Deviation
st.stdev(dframe['C1'])

In [ ]:
#Population Standard Deviation
st.pstdev(dframe['C1'])

## Apply function on Dataframe

In [ ]:
dframe

In [ ]:
# Finding MAX value in Columns
dframe.apply(max)

In [ ]:
# Finding minimum value in Columns
dframe.apply(min)

In [ ]:
#Sum of Column Values
dframe.apply(sum)

In [ ]:
#Sum of Column Values
dframe.apply(np.sum)

In [ ]:
# Sum of rows
dframe.apply(np.sum ,axis=1)

In [ ]:
# Square root of all values in a DataFrame
dframe.applymap(np.sqrt)

In [ ]:
# Square root of all values in a DataFrame
dframe.applymap(math.sqrt)

In [ ]:
dframe.applymap(float)

In [ ]:
# Using Lambda function in Dataframes
dframe.apply(lambda x: min(x))

In [ ]:
# Using Lambda function in Dataframes
dframe.apply(lambda x: x*x)

# Merge Dataframes